app/controllers/autors_controller.rb

  def index
  	if params[:search]
  		@autors = Autor.search(params[:search])
---
SELECT "autors".* FROM "autors"

  def create
    @autor = Autor.new(autor_params)

    respond_to do |format|
      if @autor.save
---
INSERT INTO "autors" ("created_at", "first_name", "name", "nationality", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-24 10:50:16.530019"], ["first_name", "Terry"], ["name", "Goodkind"], ["nationality", "American"], ["updated_at", "2014-12-24 10:50:16.530019"]]

    def set_autor
      @autor = Autor.find(params[:id])
---
SELECT  "autors".* FROM "autors"  WHERE "autors"."id" = ? LIMIT 1  [["id", 1]]