app/controllers/books_controller.rb

INSERT INTO "books" ("autor_name", "collection", "cote", "created_at", "editor", "kind", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "cote" = ?, "updated_at" = ? WHERE "books"."id" = 5  [["cote", "HF-002"], ["updated_at", "2014-12-24 10:55:12.195315"]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)