app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
  	if params[:search]
  		@kinds = Kind.search(params[:search])

INSERT INTO "kinds" ("cote", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["cote", "HF"], ["created_at", "2014-12-24 10:55:22.271977"], ["name", "High Fantasy"], ["updated_at", "2014-12-24 10:55:22.271977"]]
---
  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save

DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 1]]
---
  def destroy
    @kind.destroy

SELECT  "kinds".* FROM "kinds"  WHERE "kinds"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_kind
      @kind = Kind.find(params[:id])